In [80]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [81]:
ser = pd.Series(['Rawabe','Rahaf','Arwa'], index = [1,2,3])
ser

1    Rawabe
2     Rahaf
3      Arwa
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [82]:
ser.index = [11,12,13]
ser

11    Rawabe
12     Rahaf
13      Arwa
dtype: object

## Q3: Retrieve First and second elements.

In [83]:
ser[:2]

11    Rawabe
12     Rahaf
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [84]:
# ser = ser.repeat(2)
# print(ser)
#or
ser1 = ser.copy()
dup = pd.concat([ser ,ser1])
dup

11    Rawabe
12     Rahaf
13      Arwa
11    Rawabe
12     Rahaf
13      Arwa
dtype: object

In [85]:
ser = ser.drop_duplicates()
print(ser)

11    Rawabe
12     Rahaf
13      Arwa
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [86]:
df = pd.DataFrame({'ID':[1,2,3],'Name':['Rawabe','Rahaf','Arwa']})
df

   ID    Name
0   1  Rawabe
1   2   Rahaf
2   3    Arwa

## Q6: Read educ_figdp_1_Data.csv file

In [87]:
df = pd.read_csv('educ_figdp_1_Data.csv')
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [88]:
df.loc[0].head()

TIME                                                               2000
GEO                                       European Union (28 countries)
INDIC_ED              Total public expenditure on education as % of ...
Value                                                                 :
Flag and Footnotes                                                  NaN
Name: 0, dtype: object

In [89]:
df[1:20]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e
15,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e
16,2004,European Union (27 countries),Total public expenditure on education as % of ...,4.95,e
17,2005,European Union (27 countries),Total public expenditure on education as % of ...,4.92,e
18,2006,European Union (27 countries),Total public expenditure on education as % of ...,4.91,e
19,2007,European Union (27 countries),Total public expenditure on education as % of ...,4.93,e